Repository: yeliulee/thinkerx_mobile
Catalog: lib/l10n/intl_*.arb
Languages: ja, ru, zh_cn

source: About
ja: ThinkerX について
ru: О компании ThinkerX
zh_cn: 关于 ThinkerX

# accountManager
source: Account
ja: アカウント
ru: Управление счетами
zh_cn: 账户管理

# appGallery
source: Gallery
ja: ツールリスト
ru: Список приложений
zh_cn: 应用列表

# askAddThisToFavorites
source: Add this app to the favorites?
ja: このアプリをコレクションに追加しますか？
ru: Добавить это приложение в коллекцию?
zh_cn: 是否收藏此应用？

source: Cache clear
ja: キャッシュの消去
ru: Очистить кэш
zh_cn: 清除缓存

# cacheClearConfirm
source: Confirm to clear the cache?
ja: キャッシュをクリアすることを確認しますか？
ru: Подтвердить очистку кэша?
zh_cn: 确认清除缓存？

# cacheClearDetail
source: Clear temporary data generated at runtime
ja: 操作中に生成された一時データを消去します。
ru: Очистите временные данные, сгенерированные во время выполнения.
zh_cn: 清除运行时产生的临时数据.

source: Choose language
ja: 言語を選択してください
ru: Выберите язык
zh_cn: 选择语言

source: Choose theme
ja: テーマを選択
ru: Выберите тему
zh_cn: 选择主题

# favoritesManager
source: Favorites
ja: 私のコレクション
ru: Моя коллекция
zh_cn: 我的收藏

# favoritesManagerSuper
source: Manage Collections
ja: コレクションの管理
ru: Управление коллекциями
zh_cn: 管理收藏

# favoritesTextAdd
source: Add to Favorites
ja: お気に入りに追加
ru: Добавить в избранное
zh_cn: 增加收藏

# favoritesTipLongPress
source: Tip: Long press to manage favorites
ja: ヒント：長押ししてお気に入りを管理します
ru: Совет: длительное нажатие для управления избранным
zh_cn: 提示: 长按可管理收藏

# followDeviceLocale
source: Follow device
ja: システムをフォローする
ru: Следуйте за системой
zh_cn: 跟随系统

source: Help and feedback
ja: ヘルプとフィードバック
ru: Справка и обратная связь
zh_cn: 帮助和反馈

# localeKey
source: en_US
ja: ja
ru: ru
zh_cn: zh_CN

# multipleLang
source: Languages
ja: 多言語
ru: Многоязычный
zh_cn: 多语言

# pageHomeTabAccount
source: Account
ja: アカウント
ru: аккаунт
zh_cn: 账户

# pageHomeTabGallery
source: Gallery
ja: リスト
ru: Список
zh_cn: 列表

# pageHomeTabHome
source: Home
ja: ホームページ
ru: Главная страница
zh_cn: 主页

# quitApp
source: Exit the app
ja: アプリを終了する
ru: Выход из приложения
zh_cn: 退出应用

source: Search tools...
ja: 検索ツール...
ru: Инструмент поиска...
zh_cn: 搜索工具...

# settingCommon
source: Common settings
ja: 一般設定
ru: Универсальные настройки
zh_cn: 通用设置

# themeBlue
source: Blue of Dreams
ja: 夢の青
ru: циан
zh_cn: 梦之蓝

# themeCyan
source: Blue of Sky
ja: 空の青
ru: синий
zh_cn: 天之蓝

# themeGreen
source: Green
ja: 緑
ru: зеленый
zh_cn: 茵之绿

# themeManager
source: Themes Manager
ja: テーマ管理
ru: Управление тематическими вопросами
zh_cn: 主题管理

# themeManagerDetail
source: Choose the theme you like
ja: 好きなテーマを選んでください
ru: Выберите тему, которую вам нравится
zh_cn: 选择你喜欢的主题

# themeOrange
source: Orange of Autumn
ja: 秋のオレンジ
ru: оранжевый
zh_cn: 秋之橙

# themePink
source: Powder of flowers
ja: 花の粉
ru: розовый
zh_cn: 花之粉

# themeRed
source: Red of Summer
ja: 夏の赤
ru: красный
zh_cn: 夏之红

# tipAppAddedToFavorites
source: The app has been added to favorites
ja: アプリがコレクションに追加されました
ru: Приложение добавлено в коллекцию
zh_cn: 该应用已添加到收藏

# tipAppAddToFavoritesSuccessfully
source: Added successfully
ja: 収集成功
ru: Успех коллекции
zh_cn: 收藏成功

# titleAlert
source: Warning
ja: 警告
ru: Предупреждение
zh_cn: 警告

# titleCancel
source: Cancel
ja: キャンセル
ru: Отменить
zh_cn: 取消

# titleConfirm
source: Confirm
ja: 確認
ru: Подтверждение
zh_cn: 确认

# titleInformation
source: Information
ja: 情報
ru: Информация
zh_cn: 信息

# titleNO
source: No
ja: いいえ
ru: Нет
zh_cn: 否

# titlePrompt
source: Hint
ja: ヒント
ru: Подсказка
zh_cn: 提示

# titleYES
source: Yes
ja: はい
ru: Да
zh_cn: 是

# toolCategoryAll
source: All
ja: すべて
ru: Все
zh_cn: 全部应用

# toolCategoryDevice
source: Device
ja: システム
ru: система
zh_cn: 设备应用

# toolCategoryFun
source: Fun
ja: 娯楽
ru: счастливый
zh_cn: 娱乐应用

# toolCategoryImage
source: Image
ja: 画像
ru: образ
zh_cn: 图片应用

# toolCategoryOthers
source: Others
ja: その他の
ru: Другой
zh_cn: 其他应用

# toolCategoryProgramming
source: Developer
ja: 開発者
ru: разработчик
zh_cn: 编程应用

# toolCategoryText
source: Text
ja: テキスト
ru: текст
zh_cn: 文本应用

# toolCategoryUniversal
source: Common
ja: 一般的な
ru: Общее
zh_cn: 通用应用

# toolNameBaseConverter
source: Base Converter
ja: 誘導型コンバータ
zh_cn: 进制转换器

# toolNameBilibiliCover
source: Bilibili Cover
zh_cn: Bilibili 封面获取

# toolNameBmiCalculator
source: BMI Calculator
ja: BMI電卓
ru: Калькулятор ИМТ
zh_cn: BMI 计算器

# toolNameChineseToPinyin
source: Chinese To Pinyin
ja: 中国語からピンイン
zh_cn: 中文转拼音

# toolNameCidrCalculator
source: CIDR Calculator
ja: CIDR 電卓
ru: Калькулятор CIDR
zh_cn: CIDR 计算器

# toolNameDeviceInfo
source: Device Info
ja: デバイス情報
ru: системное сообщение
zh_cn: 设备信息

# toolNameExpressInquiry
source: Express Inquiry
ja: 宅配便情報
ru: Экспресс-запросы
zh_cn: 快递查询

# toolNameGarbageSortQuery
source: Garbage Sort
ja: ごみの分類
ru: Категоризация
zh_cn: 垃圾分类查询

# toolNameHistoryToday
source: History Today
ja: 今日の歴史
ru: сегодня в истории
zh_cn: 历史上的今天

# toolNameImageCompressor
source: Image Compressor
ja: 画像圧縮
ru: Сжатие изображения
zh_cn: 图片压缩

# toolNameIpInformationQuery
source: IP Information
ja: IP 情報クエリー
ru: IP-запрос
zh_cn: IP 信息查询

# toolNameMarketingArticle
source: Marketing Article
zh_cn: 营销号文章生成

# toolNameMd5Summary
source: Md5 Summary
ja: MD5 サマリー
ru: Сводка MD5
zh_cn: MD5 摘要

# toolNameMorseCode
source: Morse Code
ja: ムース符号
ru: Код лося
zh_cn: 摩斯电码

# toolNameNumberToChinese
source: Number To Chinese
ja: デジタルから中国語へ
ru: Цифровая на китайский
zh_cn: 数字转中文

# toolNameQrCode
source: QRCode Tool
ja: QRコードツール
ru: Инструменты QR-кода
zh_cn: 二维码工具

# toolNameRelationshipCalculator
source: Kinship calculator
ja: 関係計算ツール
ru: Калькулятор отношений
zh_cn: 亲戚关系计算器

# toolNameScreenInfo
source: Screen Info
ja: 画面情報
ru: Информация об экране
zh_cn: 屏幕信息

# toolNameSystemInfo
source: System Info
ja: システム情報
ru: Информация о системе
zh_cn: 系统信息

# toolNameUrlEncoder
source: URL Encoder
ja: URL エンコーダー
ru: Кодировка URL
zh_cn: URL 编码

# toolNameVideoToGif
source: Video To Gif
ja: ビデオからGIFへ
ru: Видео в GIF
zh_cn: 视频转 GIF

# toolNameWhatAnime
source: What Anime
zh_cn: 以图搜番

# toolNameRandomNumber
source: Random Number
zh_cn: 随机数生成
